tap "1password/tap"
tap "fluxcd/tap"
tap "go-task/tap"
tap "hashicorp/tap"
tap "johanhaleby/kubetail"
brew "age"
brew "tree"
brew "ansible"
brew "ansible-lint"
brew "argocd"
brew "autoconf"
brew "automake"
brew "bash-completion"
brew "bat"
brew "btop"
brew "bzip2"
brew "cloudflared"
brew "cmake"
brew "cmctl"
brew "curl"
brew "direnv"
brew "eza"
brew "fastfetch"
brew "fd"
brew "fnm"
brew "fpp"
brew "fx"
brew "fzf"
brew "gdk-pixbuf"
brew "gh"
brew "git"
brew "git-delta"
brew "gitleaks"
brew "gnu-sed"
brew "gnu-units"
brew "gnupg"
brew "harfbuzz"
brew "pango"
brew "gnuplot"
brew "go"
brew "go-task"
brew "gowsdl"
brew "librsvg"
brew "graphviz"
brew "helm"
brew "htop"
brew "hugo"
brew "icloudpd"
brew "icu4c@76"
brew "imagemagick"
brew "inetutils"
brew "ipcalc"
brew "jq"
brew "k3sup"
brew "k9s"
brew "ksops"
brew "kubeconform"
brew "kubernetes-cli"
brew "kubectx"
brew "kustomize"
brew "lazygit"
brew "libffi"
brew "libxml2"
brew "libxslt"
brew "llvm"
brew "make"
brew "mosquitto"
brew "neovim"
brew "nghttp2"
brew "node"
brew "nut"
brew "ollama"
brew "openjdk"
brew "opentofu"
brew "pkgconf"
brew "powerlevel10k"
brew "pre-commit"
brew "prettier"
brew "pstree"
brew "pv"
brew "python@3.10"
brew "python@3.11"
brew "qt"
brew "rcm"
brew "ripgrep"
brew "sops"
brew "sshuttle"
brew "telnet", link: false
brew "terraform"
brew "tmux"
brew "todoist-cli"
brew "uv"
brew "vim"
brew "wakeonlan"
brew "watch"
brew "wget"
brew "wireshark", link: false
brew "yq"
brew "zoxide"
brew "zsh"
brew "zsh-async"
brew "zsh-autosuggestions"
brew "zsh-fast-syntax-highlighting"
brew "fluxcd/tap/flux"
brew "hashicorp/tap/packer"
brew "johanhaleby/kubetail/kubetail"
cask "1password"
cask "1password-cli"
cask "alfred"
cask "antigravity"
cask "balenaetcher"
cask "claude"
cask "dbeaver-community"
cask "discord"
cask "docker-desktop"
cask "dropbox"
cask "font-dejavu"
cask "font-fira-code-nerd-font"
cask "font-hack-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "font-liberation"
cask "font-noto-sans"
cask "font-open-sans"
cask "font-source-code-pro"
cask "github"
cask "google-chrome"
cask "google-drive"
cask "iterm2"
cask "netnewswire"
cask "obsidian"
cask "rectangle"
cask "todoist-app"
cask "visual-studio-code"
cask "vlc"
cask "wireshark-app"
vscode "alexcvzz.vscode-sqlite"
vscode "anthropic.claude-code"
vscode "bradlc.vscode-tailwindcss"
vscode "catppuccin.catppuccin-vsc"
vscode "cschlosser.doxdocgen"
vscode "dart-code.dart-code"
vscode "dart-code.flutter"
vscode "davidanson.vscode-markdownlint"
vscode "deerawan.vscode-dash"
vscode "docker.docker"
vscode "enkia.tokyo-night"
vscode "foxundermoon.shell-format"
vscode "github.codespaces"
vscode "github.copilot-chat"
vscode "github.github-vscode-theme"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "golang.go"
vscode "google.gemini-cli-vscode-ide-companion"
vscode "google.geminicodeassist"
vscode "hashicorp.hcl"
vscode "hashicorp.terraform"
vscode "jeff-hykin.better-cpp-syntax"
vscode "kennylong.kubernetes-yaml-formatter"
vscode "mechatroner.rainbow-csv"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-dotnettools.csdevkit"
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpp-devtools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "ms-vscode.theme-markdownkit"
vscode "mtxr.sqltools"
vscode "mtxr.sqltools-driver-sqlite"
vscode "qwtel.sqlite-viewer"
vscode "redhat.ansible"
vscode "redhat.vscode-xml"
vscode "redhat.vscode-yaml"
vscode "rust-lang.rust-analyzer"
vscode "streetsidesoftware.code-spell-checker"
vscode "tailscale.vscode-tailscale"
vscode "tamasfe.even-better-toml"
vscode "twxs.cmake"
vscode "vscodevim.vim"
vscode "weaveworks.vscode-gitops-tools"
vscode "wholroyd.jinja"
go "github.com/go-delve/delve/cmd/dlv"
go "golang.org/x/tools/gopls"
go "honnef.co/go/tools/cmd/staticcheck"
